Revit 2025 API
LinePatternSegmentType Enumeration
 Represents the type of a line pattern segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LinePatternSegmentType
Public Enumeration LinePatternSegmentType
public enum class LinePatternSegmentType
type LinePatternSegmentType
Members
Member name | Value | Description
Dash | 0 |  A dash
Space | 1 |  A space
Dot | 2 |  A dot
Invalid | 3
See Also
Reference
Autodesk.Revit.DB Namespace